package Codefromnazarii;

public class Hello1 {
}


// зробити тамлицю множення числа 7



//Завдання 1
//        Напишіть метод, який приймає число та повертає суму цифр цього числа.
//Завдання 2
//        Напишіть метод, який приймає число, яке не містить нулів та повертає цифри у зворотному порядку.
//        Наприклад, на вхід 789, на вихід 987.
//Завдання 3
//        Створіть програму, яка виводить у консоль число імені, наприклад, на вхід Roman = R(18) + O(15) + M(13) + A(1) + N(14) = 61, на вихід
//61.
//Завдання 4
//        Створіть програму, яка виводить у консоль число дати. Наприклад, на вхід 02/11/1995 = 0 + 2 + 1 + 1 + 1 + 9 + 9 + 5 = 28, на вихід = 28.
