package AnnaP;

public class Hello {
    public static void main(String[] args) {
        int[][]arr1 = {{1,2,3},{1,2,3},{7,8,9}};
        int[][]arr2 = {{100,200,300},{1,2,3},{17,18,19}};
        arraySum(arr1,arr2);
    }

    public static void arraySum(int[][] arr1, int[][] arr2){
        int[][] arrSum = new int[3][3];
        for (int i = 0; i < 3; i++) {
            for (int j = 0; j < 3; j++) {
              arrSum[i][j] = arr1[i][j] + arr2[i][j];
                System.out.print(arrSum[i][j]+" ");
            }
            System.out.println();
        }

    }
}
// 2 двовимірних массиви 3х3 в третій масси передати сумму цих двох масивів




//Завдання 1
//        Напишіть метод, який приймає число та повертає суму цифр цього числа.
//Завдання 2
//        Напишіть метод, який приймає число, яке не містить нулів та повертає цифри у зворотному порядку.
//        Наприклад, на вхід 789, на вихід 987.
//Завдання 3
//        Створіть програму, яка виводить у консоль число імені, наприклад, на вхід Roman = R(18) + O(15) + M(13) + A(1) + N(14) = 61, на вихід
//61.
//Завдання 4
//        Створіть програму, яка виводить у консоль число дати. Наприклад, на вхід 02/11/1995 = 0 + 2 + 1 + 1 + 1 + 9 + 9 + 5 = 28, на вихід = 28.
